In [2]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Name change

In [3]:
old_name = 'HREIT'
new_name = 'WHAIR'

In [4]:
sql = '''
SELECT *
FROM stockname
WHERE name = "%s"'''
sql = sql % (old_name)
stock = pd.read_sql(sql, const)
stock

Empty DataFrame
Columns: [name, category, sector, inport, onwatch, hd, top100]
Index: []

In [5]:
sql = '''
UPDATE stockname
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stockname
SET name = "WHAIR"
WHERE name = "HREIT"

In [6]:
rp = const.execute(sql)
rp.rowcount

0

In [7]:
sql = '''
SELECT *
FROM price
WHERE name = "%s"'''
sql = sql % (old_name)
price = pd.read_sql(sql, const)
price.shape

(1334, 7)

In [8]:
sql = '''
UPDATE price
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE price
SET name = "WHAIR"
WHERE name = "HREIT"

In [9]:
rp = const.execute(sql)
rp.rowcount

1334

In [10]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "WHAIR"
WHERE name = "HREIT"

In [11]:
rp = conlite.execute(sql)
rp.rowcount

1

In [4]:
sql = '''
UPDATE buy
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE buy
SET name = "WHAIR"
WHERE name = "HREIT"

In [5]:
rp = const.execute(sql)
rp.rowcount

1

### Tickers table

In [12]:
sql = '''
SELECT *
FROM tickers
WHERE name = "%s"'''
sql = sql % (old_name)
ticker = pd.read_sql(sql, conlt)
ticker

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,211,HREIT,HEMARAJ LEASEHOLD REAL ESTATE INVESTMENT TRUST,Property & Construction,Property Fund & REITs,SET,www.hemarajreit.com,2017-07-23 06:31:14.694180,2017-07-23 06:31:14.694180

In [13]:
sql = '''
UPDATE tickers
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE tickers
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [14]:
rp = conlt.execute(sql)
rp.rowcount

1

In [15]:
rp = conmy.execute(sql)
rp.rowcount

1

In [16]:
rp = conpg.execute(sql)
rp.rowcount

1

### Stocks table

In [17]:
sql = '''
UPDATE stocks
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [18]:
rp = conlt.execute(sql)
rp.rowcount

1

In [19]:
rp = conmy.execute(sql)
rp.rowcount

1

In [20]:
rp = conpg.execute(sql)
rp.rowcount

1

### EPSS table

In [21]:
sql = '''
UPDATE epss
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE epss
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [22]:
rp = conlt.execute(sql)
rp.rowcount

21

In [23]:
rp = conpg.execute(sql)
rp.rowcount

21

### QT_PROFITS table

In [24]:
sql = '''
UPDATE qt_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE qt_profits
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [25]:
rp = conlt.execute(sql)
rp.rowcount

17

### YR_PROFITS table

In [26]:
sql = '''
UPDATE yr_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE yr_profits
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [27]:
rp = conlt.execute(sql)
rp.rowcount

14

In [28]:
rp = conpg.execute(sql)
rp.rowcount

14

### PROFITS table

In [29]:
sql = '''
UPDATE profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE profits
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [30]:
rp = conlt.execute(sql)
rp.rowcount

0

In [31]:
rp = conmy.execute(sql)
rp.rowcount

0

In [32]:
rp = conpg.execute(sql)
rp.rowcount

0

### CONSENSUS table

In [33]:
sql = '''
UPDATE consensus
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE consensus
SET name = 'WHAIR'
WHERE name = 'HREIT'

In [34]:
rp = conlt.execute(sql)
rp.rowcount

1

In [35]:
rp = conmy.execute(sql)
rp.rowcount

1

In [36]:
rp = conpg.execute(sql)
rp.rowcount

1

### Portfolio database

In [37]:
sql = '''
SELECT * 
FROM stocks
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

    id   name  category_id website
0  156  HREIT            3

In [38]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "WHAIR"
WHERE name = "HREIT"

In [39]:
rp = conpf.execute(sql)
rp.rowcount

1

In [40]:
sql = '''
SELECT * 
FROM dividends
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

,id,stock_id,name,year,quarter,number,ppu,amt,net,x_date,p_date
0,173,156,HREIT,2020,2,12000,0.1715,2058.00,1852.20,2020-08-18,2020-09-18
1,186,156,HREIT,2020,3,30000,0.1715,5145.00,4630.50,2020-11-24,2020-12-14
2,187,156,HREIT,2020,4,30000,0.1718,5154.00,4638.00,2020-12-04,2020-12-24
3,203,156,HREIT,2021,1,30000,0.1738,5214.00,4692.60,2021-05-25,2021-06-25
4,274,156,HREIT,2021,2,30000,0.1738,5214.00,4692.60,2021-08-23,2021-09-21
5,294,156,HREIT,2021,3,10000,0.1738,1738.00,1564.20,2021-11-23,2021-12-23
6,298,156,HREIT,2020,4,30000,0.0860,2580.00,2322.00,2021-03-03,2021-03-30
7,305,156,HREIT,2021,4,40100,0.1738,6969.38,6272.44,2022-03-04,2022-03-30

In [41]:
sql = '''
UPDATE dividends
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE dividends
SET name = "WHAIR"
WHERE name = "HREIT"

In [42]:
rp = conpf.execute(sql)
rp.rowcount

8

### Manually chage name-ttl.csv & price-uploads.csv